app/views/songs/show_user.html.erb

SELECT DISTINCT "adds".* FROM "adds" WHERE "adds"."user_id" = $1  [["user_id", 2]]
SELECT "adds".* FROM "adds" WHERE "adds"."user_id" = $1  [["user_id", 2]]
SELECT "songs".* FROM "songs" WHERE "songs"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "adds" WHERE "adds"."user_id" = $1 AND "adds"."song_id" = $2  [["user_id", 2], ["song_id", 4]]
---
            <tbody>
            <% Add.select(:song_id).uniq.each do |hey| %>
            <tr>
            <% if Add.where(user_id: @user.id, song_id: hey.song_id).count != 0 %>