app/views/songs/show_song.html.erb

SELECT DISTINCT "adds".* FROM "adds" WHERE "adds"."song_id" = $1  [["song_id", 2]]
SELECT COUNT(*) FROM "adds" WHERE "adds"."user_id" = $1 AND "adds"."song_id" = $2  [["user_id", 1], ["song_id", 5]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            <tbody>
                <% Add.select(:user_id).uniq.each do |lol| %>
            <tr>
            <% if Add.where(user_id: lol.user_id, song_id: @song.id).count != 0 %>
                <td><a href='/user/show/<%= User.find(lol.user_id).id %>'><%= User.find(lol.user_id).first_name %></a> </td>