app/views/songs/songs.html.erb

SELECT COUNT(*) FROM "adds" WHERE "adds"."song_id" = $1  [["song_id", 1]]
---
                    <td><a href='/song/show/<%= songs.id %>'><%= songs.title %></a></td>
                    <td><%= songs.adds.count %> </td>