app/controllers/session_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def create
    if params['user']['password'] == params['user']['confirm_password']
      @user = User.create ( user_params )
      if @user.valid?
        session[:user_id] = User.last.id

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "adamdanielrice1@gmail.com"], ["LIMIT", 1]]
---
  def login
    @user=User.find_by_email(params['email_login'])