app/controllers/songs_controller.rb

INSERT INTO "songs" ("artist", "title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist", "Kanye"], ["title", "Power"], ["user_id", 1], ["created_at", "2019-10-18 14:55:23.781171"], ["updated_at", "2019-10-18 14:55:23.781171"]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 6]]
---
  def create_song
    if session[:user_id] == nil
      redirect_to '/'
    else
      @songs = Song.create (songs_params)
      if @songs.user_id == session[:user_id]
        if @songs.valid?
          redirect_to '/songs'
        else
          redirect_to '/songs', alert: @songs.errors.full_messages
        end
      else
        @songs.destroy

INSERT INTO "adds" ("song_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["song_id", 2], ["user_id", 1], ["created_at", "2019-10-18 15:04:54.124443"], ["updated_at", "2019-10-18 15:04:54.124443"]]
---
  def add
    if session[:user_id] == nil
      redirect_to '/'
    else
      @add = Add.new
      @add.user_id = session[:user_id]
      @add.song_id = params[:song_id]
      @add.save

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "adds".* FROM "adds" WHERE "adds"."song_id" = $1  [["song_id", 2]]
---
  def show_song
    if session[:user_id] == nil
      redirect_to '/'
    else
      @song = Song.find(params[:id])
      @users = Add.where(song_id: @song.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "adds".* FROM "adds" WHERE "adds"."user_id" = $1  [["user_id", 2]]
SELECT "adds".* FROM "adds"
---
  def show_user
    if session[:user_id] == nil
      redirect_to '/'
    else
      @user = User.find(params[:id])
      @other = Add.where(user_id: params[:id])
      @songs = Add.where

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" LEFT OUTER JOIN "adds" ON "adds"."song_id" = "songs"."id" GROUP BY "songs"."id" ORDER BY COUNT(adds.id) DESC
---
  def songs
    if session[:user_id] == nil
      redirect_to '/'
    else
    @user = User.find(session[:user_id])
    @songs = Song.left_joins(:adds).group(:id).order('COUNT(adds.id) ASC')